Aligning Data Frame

In [1]:
import pandas as pd

In [5]:
df1=pd.DataFrame([[1,5,9],[5,2,10],[30,9,2]])
df1.columns=['B','C','E']
df1

    B  C   E
0   1  5   9
1   5  2  10
2  30  9   2

In [8]:
df2=pd.DataFrame([[9,10,5,2],[1,2,3,4],[5,8,2,4],[1,8,7,9]])
df2.columns=['A','B','D','F']
df2

   A   B  D  F
0  9  10  5  2
1  1   2  3  4
2  5   8  2  4
3  1   8  7  9

Left Join-Consider only left table

In [14]:
left,right =df1.align(df2,join='left')

In [15]:
left

    B  C   E
0   1  5   9
1   5  2  10
2  30  9   2

In [16]:
right

    B   C   E
0  10 NaN NaN
1   2 NaN NaN
2   8 NaN NaN

In [17]:
left,right=df1.align(df2,join='right')

In [18]:
left

    A     B   D   F
0 NaN   1.0 NaN NaN
1 NaN   5.0 NaN NaN
2 NaN  30.0 NaN NaN
3 NaN   NaN NaN NaN

In [19]:
right

   A   B  D  F
0  9  10  5  2
1  1   2  3  4
2  5   8  2  4
3  1   8  7  9

In [20]:
left,right=df1.align(df2,join='outer')

In [21]:
left

    A     B    C   D     E   F
0 NaN   1.0  5.0 NaN   9.0 NaN
1 NaN   5.0  2.0 NaN  10.0 NaN
2 NaN  30.0  9.0 NaN   2.0 NaN
3 NaN   NaN  NaN NaN   NaN NaN

In [22]:
right

   A   B   C  D   E  F
0  9  10 NaN  5 NaN  2
1  1   2 NaN  3 NaN  4
2  5   8 NaN  2 NaN  4
3  1   8 NaN  7 NaN  9